# 반복문?
# 계속 반복 시켜주는 거 
# 어떤 거를? 숫자? 코드를 반복시켜주는 것

# 반복문 => 코드를 반복시킴
# range 라는건 범위 -> range(5) => 0~4
# for i in range(5):
#     print(i)
# i값이 0~4까지 print(i)를 
# 반복시켜주겟다

# a=[1,2,3,4,5]
# for i in range(len(a)):
#     print(a[i])

k=int(input())
# input - 입력받다
# int - integer의 약자 - 정수 
# 자연수 1, 2 ,3, 4 => 양수
# 0 => 0
# -1 -2 -3 => 음수 

# 만약 k라는 수를 2로 나누었을때
# 나누어 떨어지지 않는다
#  => 홀수
# 만약 k라는 수를 2로 나누었을때
# 나누어 떨어진다
#  => 짝수

if k %2==0:
    print('짝수입니다.')
if k %2!=0:
    print('홀수입니다.')
# 나눗셈 기호 : / %
# / => 몫
# % => 나머지

    # 코드









